// Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.


string input = "Hello, World!";
System.Console.WriteLine(input.ToLower());
